chfbryf/TI_project/m0_template/test.syscfg
GPIO9.$name                              = "LED";
GPIO9.port                               = "PORTB";
GPIO9.associatedPins.create(2);
GPIO9.associatedPins[0].internalResistor = "PULL_UP";
GPIO9.associatedPins[0].assignedPin      = "25";
GPIO9.associatedPins[0].$name            = "LED3";
GPIO9.associatedPins[1].$name            = "LED4";
GPIO9.associatedPins[1].assignedPin      = "26";
GPIO9.associatedPins[1].internalResistor = "PULL_UP";

GPIO10.$name                              = "BUZZER";
GPIO10.port                               = "PORTB";
GPIO10.associatedPins[0].assignedPin      = "13";
GPIO10.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO10.associatedPins[0].$name            = "buzzer";

GPIO11.$name                          = "Gray_address";
GPIO11.associatedPins.create(3);
GPIO11.associatedPins[0].$name        = "PIN_4";
GPIO11.associatedPins[0].assignedPort = "PORTA";
GPIO11.associatedPins[0].assignedPin  = "26";
GPIO11.associatedPins[1].$name        = "PIN_5";
GPIO11.associatedPins[1].assignedPort = "PORTA";
GPIO11.associatedPins[1].assignedPin  = "7";
GPIO11.associatedPins[2].$name        = "PIN_6";
GPIO11.associatedPins[2].assignedPort = "PORTA";
GPIO11.associatedPins[2].assignedPin  = "18";

GPIO12.$name                          = "CS";
GPIO12.associatedPins[0].$name        = "PIN_7";
GPIO12.associatedPins[0].assignedPort = "PORTB";
GPIO12.associatedPins[0].assignedPin  = "6";

GPIO13.$name                          = "INT1";
GPIO13.associatedPins[0].$name        = "PIN_8";
GPIO13.associatedPins[0].direction    = "INPUT";
GPIO13.associatedPins[0].assignedPort = "PORTB";
GPIO13.associatedPins[0].assignedPin  = "11";
GPIO13.associatedPins[0].interruptEn  = true;
GPIO13.associatedPins[0].polarity     = "RISE";

I2C1.$name                             = "I2C_OLED";
I2C1.basicEnableController             = true;
I2C1.basicControllerStandardBusSpeed   = "Fast";
I2C1.peripheral.sdaPin.$assign         = "PA28";
I2C1.peripheral.sclPin.$assign         = "PA31";
I2C1.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sdaPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
I2C1.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sclPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";

I2C2.$name                             = "I2C_MPU6050";
I2C2.basicEnableController             = true;
I2C2.basicControllerStandardBusSpeed   = "Fast";
I2C2.peripheral.$assign                = "I2C1";
I2C2.peripheral.sdaPin.$assign         = "PB3";
I2C2.peripheral.sclPin.$assign         = "PB2";
I2C2.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C2.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C2.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C2.sdaPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
I2C2.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C2.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C2.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C2.sclPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";

PWM1.$name                      = "PWM_0";
PWM1.timerStartTimer            = true;
PWM1.pwmMode                    = "EDGE_ALIGN_UP";
PWM1.timerCount                 = 3200;
PWM1.peripheral.$assign         = "TIMG8";
PWM1.peripheral.ccp0Pin.$assign = "PA1";
PWM1.peripheral.ccp1Pin.$assign = "PA0";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric5";
PWM1.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric4";

PWM2.$name                              = "SERVO";
PWM2.timerStartTimer                    = true;
PWM2.timerCount                         = 400;
PWM2.clockDivider                       = 8;
PWM2.clockPrescale                      = 250;
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC2";
PWM2.PWM_CHANNEL_0.invert               = true;
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric16";
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.peripheral.$assign                 = "TIMA0";
PWM2.peripheral.ccp0Pin.$assign         = "PB14";
PWM2.peripheral.ccp1Pin.$assign         = "PA3";
PWM2.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC3";
PWM2.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric17";

SPI1.$name                      = "SPI_0";
SPI1.frameFormat                = "MOTO3";
SPI1.sclkPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric11";
SPI1.mosiPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric12";
SPI1.misoPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric13";
SPI1.peripheral.sclkPin.$assign = "PB9";
SPI1.peripheral.mosiPin.$assign = "PB8";
SPI1.peripheral.misoPin.$assign = "PB7";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;

TIMER1.$name              = "TIMER_xunji_pid";
TIMER1.timerClkPrescale   = 100;
TIMER1.timerStartTimer    = true;
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerMode          = "PERIODIC";
TIMER1.timerPeriod        = "1 ms";
TIMER1.peripheral.$assign = "TIMG7";

TIMER2.timerMode          = "PERIODIC_UP";
TIMER2.timerPeriod        = "50 ms";
TIMER2.timerStartTimer    = true;
TIMER2.interrupts         = ["LOAD"];
TIMER2.timerClkDiv        = 8;
TIMER2.timerClkPrescale   = 100;
TIMER2.$name              = "SPEED_PID";
TIMER2.peripheral.$assign = "TIMG6";

UART1.$name                    = "UART_0";
UART1.targetBaudRate           = 115200;
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric2";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric3";

UART2.enabledInterrupts                = ["RX"];
UART2.$name                            = "BLE_MASTER";
UART2.peripheral.$assign               = "UART1";
UART2.peripheral.rxPin.$assign         = "PA9";
UART2.peripheral.txPin.$assign         = "PA8";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";

UART3.targetBaudRate                   = 115200;
UART3.$name                            = "vision";
UART3.peripheral.$assign               = "UART2";
UART3.peripheral.rxPin.$assign         = "PA22";
UART3.peripheral.txPin.$assign         = "PA21";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric14";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ADC121.peripheral.$suggestSolution             = "ADC0";
ADC121.DMA_CHANNEL.peripheral.$suggestSolution = "DMA_CH0";
Board.peripheral.$suggestSolution              = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution     = "PA20";
Board.peripheral.swdioPin.$suggestSolution     = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution   = "PA25";
GPIO2.associatedPins[0].pin.$suggestSolution   = "PA12";
GPIO2.associatedPins[1].pin.$suggestSolution   = "PA13";
GPIO3.associatedPins[0].pin.$suggestSolution   = "PB24";
GPIO3.associatedPins[1].pin.$suggestSolution   = "PB18";
GPIO3.associatedPins[2].pin.$suggestSolution   = "PA14";
GPIO3.associatedPins[3].pin.$suggestSolution   = "PB19";
GPIO3.associatedPins[4].pin.$suggestSolution   = "PB20";
GPIO4.associatedPins[0].pin.$suggestSolution   = "PA17";
GPIO4.associatedPins[1].pin.$suggestSolution   = "PA16";
GPIO4.associatedPins[2].pin.$suggestSolution   = "PB1";
GPIO4.associatedPins[3].pin.$suggestSolution   = "PB4";
GPIO5.associatedPins[0].pin.$suggestSolution   = "PB0";
GPIO6.associatedPins[0].pin.$suggestSolution   = "PA2";
GPIO7.associatedPins[0].pin.$suggestSolution   = "PB16";
GPIO8.associatedPins[0].pin.$suggestSolution   = "PB22";
GPIO8.associatedPins[1].pin.$suggestSolution   = "PB23";
GPIO9.associatedPins[0].pin.$suggestSolution   = "PB25";
GPIO9.associatedPins[1].pin.$suggestSolution   = "PB26";
GPIO10.associatedPins[0].pin.$suggestSolution  = "PB13";
GPIO11.associatedPins[0].pin.$suggestSolution  = "PA26";
GPIO11.associatedPins[1].pin.$suggestSolution  = "PA7";
GPIO11.associatedPins[2].pin.$suggestSolution  = "PA18";
GPIO12.associatedPins[0].pin.$suggestSolution  = "PB6";
GPIO13.associatedPins[0].pin.$suggestSolution  = "PB11";
I2C1.peripheral.$suggestSolution               = "I2C0";
SPI1.peripheral.$suggestSolution               = "SPI1";
